ConvertToK.introduction=\u041F\u0440\u0435\u0434\u0438 \u0434\u0430 \u043F\u0440\u0438\u0441\u0442\u044A\u043F\u0438\u043C \u043A\u044A\u043C \u0442\u044A\u0440\u0441\u0435\u043D\u0435 \u043D\u0430 \u043E\u043F\u0442\u0438\u043C\u0430\u043B\u043D\u043E \u0440\u0435\u0448\u0435\u043D\u0438\u0435 \u0447\u0440\u0435\u0437 \u0441\u0438\u043C\u043F\u043B\u0435\u043A\u0441 \u043C\u0435\u0442\u043E\u0434\u0430, \u043F\u0440\u0435\u043E\u0431\u0440\u0430\u0437\u0443\u0432\u0430\u043C\u0435 \u0434\u0430\u0434\u0435\u043D\u0430\u0442\u0430 \u043B\u0438\u043D\u0435\u0439\u043D\u0430 \u043E\u043F\u0442\u0438\u043C\u0438\u0437\u0430\u0446\u0438\u043E\u043D\u043D\u0430 \u0437\u0430\u0434\u0430\u0447\u0430 \u0434\u043E \u0442. \u043D\u0430\u0440. \u0442\u0438\u043F "\u041A-\u0437\u0430\u0434\u0430\u0447\u0430" (\u041A\u0430\u043D\u043E\u043D\u0438\u0447\u043D\u0430 \u0437\u0430\u0434\u0430\u0447\u0430) - \u0437\u0430\u0434\u0430\u0447\u0430 \u0437\u0430 \u043C\u0438\u043D\u0438\u043C\u0443\u043C \u0441 \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u044F \u0440\u0430\u0432\u0435\u043D\u0441\u0442\u0432\u0430, \u0447\u0438\u0438\u0442\u043E \u0434\u0435\u0441\u043D\u0438 \u0441\u0442\u0440\u0430\u043D\u0438 \u0441\u0430 \u043D\u0435\u043E\u0442\u0440\u0438\u0446\u0430\u0442\u0435\u043B\u043D\u0438 \u0447\u0438\u0441\u043B\u0430 \u0438 \u0432\u044A\u0440\u0445\u0443 \u0432\u0441\u0438\u0447\u043A\u0438 \u043F\u0440\u043E\u043C\u0435\u043D\u043B\u0438\u0432\u0438 \u0441\u0430 \u043D\u0430\u043B\u043E\u0436\u0435\u043D\u0438 \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u044F \u0437\u0430 \u043D\u0435\u043E\u0442\u0440\u0438\u0446\u0430\u0442\u0435\u043B\u043D\u043E\u0441\u0442
ConvertToK.minimumNeeded=\u0412\u0441\u0438\u0447\u043A\u0438 \u043E\u043F\u0442\u0438\u043C\u0438\u0437\u0430\u0446\u0438\u043E\u043D\u043D\u0438 \u0437\u0430\u0434\u0430\u0447\u0438, \u043A\u043E\u0438\u0442\u043E \u0440\u0435\u0448\u0430\u0432\u0430\u043C\u0435 \u0441\u0430 \u0437\u0430 \u041C\u0418\u041D\u0418\u041C\u0423\u041C \u043D\u0430 \u0446\u0435\u043B\u0435\u0432\u0430\u0442\u0430 \u0444\u0443\u043D\u043A\u0446\u0438\u044F
ConvertToK.alreadyMinimum=\u0412 \u0434\u0430\u0434\u0435\u043D\u0430\u0442\u0430 \u0437\u0430\u0434\u0430\u0447\u0430 \u0432\u0435\u0447\u0435 \u0441\u0435 \u0442\u044A\u0440\u0441\u0438 \u043C\u0438\u043D\u0438\u043C\u0443\u043C. \u0421\u043C\u0435\u043B\u043E \u043D\u0430\u043F\u0440\u0435\u0434
ConvertToK.toMinimum=\u041F\u0440\u0435\u043E\u0431\u0440\u0430\u0437\u0443\u0432\u0430\u043C\u0435 \u043A\u044A\u043C \u0437\u0430\u0434\u0430\u0447\u0430 \u0437\u0430 \u043C\u0438\u043D\u0438\u043C\u0443\u043C \u043F\u043E \u043F\u0440\u0430\u0432\u0438\u043B\u043E\u0442\u043E \\\\(MAX Z \= - MIN (-Z)\\\\). T.\u0435. \u043E\u0431\u0440\u044A\u0449\u0430\u043C\u0435 \u0437\u043D\u0430\u043A\u0430 \u043D\u0430 \u0432\u0441\u0438\u0447\u043A\u0438 \u043A\u043E\u0435\u0444\u0438\u0446\u0438\u0435\u043D\u0442\u0438 \u0432 \u0446\u0435\u043B\u0435\u0432\u0430\u0442\u0430 \u0444\u0443\u043D\u043A\u0446\u0438\u044F
ConvertToK.processNegativeParts=\u0412\u0441\u044F\u043A\u0430 \u043F\u0440\u043E\u043C\u0435\u043D\u043B\u0438\u0432\u0430 \\\\( x_i \\\\), \u0437\u0430 \u043A\u043E\u044F\u0442\u043E \u043D\u044F\u043C\u0430\u043C\u0435 \u0438\u0437\u0438\u0441\u043A\u0432\u0430\u043D\u0435 \\\\( x_i \\geq 0 \\\\), \u044F \u0437\u0430\u043C\u0435\u043D\u044F\u043C\u0435 \u0441 2 \u043D\u043E\u0432\u0438\: \\\\( x_i \= x_i^+ - x_i^- \\\\), \u0447\u0435 \\\\( x_i^+ \\geq 0, x_i^- \\geq 0 \\\\).
ConvertToK.rightSidesToPositiveRule=\u0417\u0430 \u0434\u0430 \u0431\u044A\u0434\u0430\u0442 \u0432\u0441\u0438\u0447\u043A\u0438 \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u044F \u0441 \u043F\u043E\u043B\u043E\u0436\u0438\u0442\u0435\u043B\u043D\u0430 \u0434\u044F\u0441\u043D\u0430 \u0447\u0430\u0441\u0442, \u043E\u0431\u0440\u044A\u0449\u0430\u043C\u0435 \u0437\u043D\u0430\u0446\u0438\u0442\u0435 \u0438\u043C, \u043A\u044A\u0434\u0435\u0442\u043E \u0435 \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E. \u0422.\u0435. \u0443\u043C\u043D\u043E\u0436\u0430\u0432\u0430\u043C\u0435 \u0438 \u0434\u0432\u0435\u0442\u0435 \u0441\u0442\u0440\u0430\u043D\u0438 \u043D\u0430 \u0434\u0430\u0434\u0435\u043D\u043E\u0442\u043E \u043D\u0435\u0440\u0430\u0432\u0435\u043D\u0441\u0442\u0432\u043E \u0441 \\\\(-1\\\\).
ConvertToK.toEquationsRule=\u0412\u0441\u044F\u043A\u043E \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u0435 \u0432\u044A\u0432 \u0444\u043E\u0440\u043C\u0430\u0442\u0430 \u043D\u0430 \u043D\u0435\u0440\u0430\u0432\u0435\u043D\u0441\u0442\u0432\u043E \u0441\u0435 \u043F\u0440\u0435\u043E\u0431\u0440\u0430\u0437\u0443\u0432\u0430 \u0432 \u0440\u0430\u0432\u0435\u043D\u0441\u0442\u0432\u043E \u0447\u0440\u0435\u0437 \u0434\u043E\u0431\u0430\u0432\u044F\u043D\u0435 \u043D\u0430 \u0434\u043E\u043F\u044A\u043B\u043D\u0438\u0442\u0435\u043B\u043D\u0430 \u043F\u0440\u043E\u043C\u0435\u043D\u043B\u0438\u0432\u0430 \u043A\u044A\u043C \u043B\u044F\u0432\u0430\u0442\u0430 \u0447\u0430\u0441\u0442. \u041A\u043E\u0435\u0444\u0438\u0446\u0438\u0435\u043D\u0442\u044A\u0442 \u0439 \u0435 \\\\(+1\\\\) \u043F\u0440\u0438 \\\\("\\leq"\\\\) \u0438 \\\\(-1\\\\) \u043F\u0440\u0438 \\\\("\\geq"\\\\).
ConvertToK.conclusion=\u0412\u0435\u0447\u0435 \u0438\u043C\u0430\u043C\u0435 \u043A\u0430\u043D\u043E\u043D\u0438\u0447\u043D\u0430 \u0437\u0430\u0434\u0430\u0447\u0430.
ConvertToM.explainBasis=\u0417\u0430 \u0434\u0430 \u043F\u0440\u0438\u0441\u0442\u044A\u043F\u0438\u043C \u043A\u044A\u043C \u043F\u0440\u0438\u043B\u0430\u0433\u0430\u043D\u0435\u0442\u043E \u043D\u0430 \u0441\u0438\u043C\u043F\u043B\u0435\u043A\u0441 \u043C\u0435\u0442\u043E\u0434\u0430, \u0442\u0440\u044F\u0431\u0432\u0430 \u0434\u0430 \u0438\u0437\u0431\u0435\u0440\u0435\u043C \u043F\u044A\u0440\u0432\u043E\u043D\u0430\u0447\u0430\u043B\u0435\u043D \u0431\u0430\u0437\u0438\u0441 - \u043F\u043E\u0434\u043C\u043D\u043E\u0436\u0435\u0441\u0442\u0432\u043E \u043D\u0430 \u0432\u0441\u0438\u0447\u043A\u0438 \u043F\u0440\u043E\u043C\u0435\u043D\u043B\u0438\u0432\u0438, \u0442\u0430\u043A\u043E\u0432\u0430 \u0447\u0435\: \u0442\u043E \u0441\u044A\u0434\u044A\u0440\u0436\u0430 \u0442\u043E\u043B\u043A\u043E\u0432\u0430 \u0435\u043B\u0435\u043C\u0435\u043D\u0442\u0430, \u043A\u043E\u043B\u043A\u043E\u0442\u043E \u043D\u0430 \u0431\u0440\u043E\u0439 \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u044F \u0438\u043C\u0430\u043C\u0435, \u0430 \u0438 \u043E\u0442 \u0432\u0441\u044F\u043A\u043E \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u0435 \u043C\u043E\u0436\u0435\u043C \u0434\u0430 \u0432\u0437\u0435\u043C\u0435\u043C \u0442\u043E\u0447\u043D\u043E \u0435\u0434\u043D\u0430 \u0431\u0430\u0437\u0438\u0441\u043D\u0430 \u043F\u0440\u043E\u043C\u0435\u043D\u043B\u0438\u0432\u0430 \u0441 \u043A\u043E\u0435\u0444\u0438\u0446\u0438\u0435\u043D\u0442 +1 \u0432 \u043D\u0435\u0433\u043E \u0438 0 \u0432 \u0434\u0440\u0443\u0433\u0438\u0442\u0435.
ConvertToM.introduction=\u0417\u0430 \u0434\u0430 \u043F\u0440\u043E\u0434\u044A\u043B\u0436\u0438\u043C, \u0442\u0440\u044F\u0431\u0432\u0430 \u0434\u0430 \u043F\u0440\u0435\u043E\u0431\u0440\u0430\u0437\u0443\u0432\u0430\u043C\u0435 \u0432 \u041C-\u0437\u0430\u0434\u0430\u0447\u0430. \u0422\u0443\u043A \u0438\u0441\u043A\u0430\u043C\u0435 \u0434\u0430 \u0438\u043C\u0430\u043C\u0435 \u0442\u043E\u043B\u043A\u043E\u0432\u0430 \u0431\u0430\u0437\u0438\u0441\u043D\u0438 \u043F\u0440\u043E\u043C\u0435\u043D\u043B\u0438\u0432\u0438, \u043A\u043E\u043B\u043A\u043E\u0442\u043E \u0441\u0430 \u0438 \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u044F\u0442\u0430. \u0422\u043E\u0432\u0430 \u0435 \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E\u0442\u043E \u0443\u0441\u043B\u043E\u0432\u0438\u0435, \u0437\u0430 \u0434\u0430 \u043F\u043E\u043B\u0443\u0447\u0438\u043C \u0431\u0430\u0437\u0438\u0441.
ConvertToM.mProblemWasGiven=\u0421\u043F\u043E\u0440\u0435\u0434 \u043A\u0440\u0438\u0442\u0435\u0440\u0438\u044F \u043D\u0430\u0448\u0430\u0442\u0430 \u0437\u0430\u0434\u0430\u0447\u0430 \u0432\u0435\u0447\u0435 \u0435 \u041C-\u0437\u0430\u0434\u0430\u0447\u0430. \u041F\u0440\u043E\u0434\u044A\u043B\u0436\u0430\u0432\u0430\u043C\u0435 \u043D\u0430\u0442\u0430\u0442\u044A\u043A.
ConvertToM.explainAddingMVars=\u0417\u0430 \u0432\u0441\u044F\u043A\u043E \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u0435, \u043A\u043E\u0435\u0442\u043E \u043D\u0435 \u043C\u043E\u0436\u0435 \u0434\u0430 \u0438\u0437\u043B\u044A\u0447\u0438 \u0441\u0432\u043E\u044F \u0431\u0430\u0437\u0438\u0441\u043D\u0430 \u043F\u0440\u043E\u043C\u0435\u043D\u043B\u0438\u0432\u0430, \u043F\u0440\u0430\u0432\u0438\u043C \u0441\u043B\u0435\u0434\u043D\u043E\u0442\u043E\: \u0414\u043E\u0431\u0430\u0432\u044F\u043C\u0435 \u043D\u043E\u0432\u0430 \u043F\u0440\u043E\u043C\u0435\u043D\u043B\u0438\u0432\u0430 \u0441 \u043A\u043E\u0435\u0444\u0438\u0446\u0438\u0435\u043D\u0442 \\\\(\u041C (\u043A\u0430\u0442\u043E M \= const. >> 0 ) \\\\) \u0432 \u0446\u0435\u043B\u0435\u0432\u0430\u0442\u0430 \u0444\u0443\u043D\u043A\u0446\u0438\u044F, \u043A\u043E\u0435\u0444\u0438\u0446\u0438\u0435\u043D\u0442 \\\\(+1\\\\) \u0432 \u0441\u044A\u043E\u0442\u0432\u0435\u0442\u043D\u043E\u0442\u043E \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u0435 \u0438 \\\\(0\\\\) \u0432 \u0434\u0440\u0443\u0433\u0438\u0442\u0435.
ConvertToM.conclusion=\u0412\u0435\u0447\u0435 \u0438\u043C\u0430\u043C\u0435 \u041C-\u0437\u0430\u0434\u0430\u0447\u0430. \u0412\u0440\u0435\u043C\u0435 \u0435 \u0434\u0430 \u043F\u0440\u0435\u043C\u0438\u043D\u0435\u043C \u043A\u044A\u043C \u0441\u044A\u0449\u0438\u043D\u0441\u043A\u0430\u0442\u0430 \u0447\u0430\u0441\u0442 \u043D\u0430 \u043C\u0435\u0442\u043E\u0434\u0430 - \u0442\u0430\u0431\u043B\u0438\u0447\u043D\u0430\u0442\u0430 \u0444\u043E\u0440\u043C\u0430.
drawEmptyTable=\u041D\u0430\u0447\u0435\u0440\u0442\u0430\u0432\u0430\u043C\u0435 \u043F\u0440\u0430\u0437\u043D\u0430 \u0441\u0438\u043C\u043F\u043B\u0435\u043A\u0441 \u0442\u0430\u0431\u043B\u0438\u0446\u0430 \u0437\u0430 \u043F\u0440\u0435\u0434\u0441\u0442\u043E\u044F\u0449\u0430\u0442\u0430 \u0438\u0442\u0435\u0440\u0430\u0446\u0438\u044F.
FirstIteration.fillFirstBasis=\u0412\u0437\u0438\u043C\u0430\u043C\u0435 \u043D\u0430\u0447\u0430\u043B\u043D\u0438\u044F \u0431\u0430\u0437\u0438\u0441, \u043A\u0430\u043A\u0442\u043E \u0438 \u0441\u044A\u043E\u0442\u0432\u0435\u0442\u043D\u0438\u0442\u0435 \u043A\u043E\u0435\u0444\u0438\u0446\u0438\u0435\u043D\u0442\u0438 \u043D\u0430 \u043F\u0440\u043E\u043C\u0435\u043D\u043B\u0438\u0432\u0438\u0442\u0435 \u043E\u0442 \u043D\u0435\u0433\u043E \u043E\u0442 \u0446\u0435\u043B\u0435\u0432\u0430\u0442\u0430 \u0444\u0443\u043D\u043A\u0446\u0438\u044F \u0438 \u0433\u0438 \u043F\u043E\u043F\u044A\u043B\u0432\u0430\u043C\u0435 \u0432 \u0442\u0430\u0431\u043B\u0438\u0446\u0430\u0442\u0430 - \u0441\u044A\u043E\u0442\u0432\u0435\u0442\u043D\u043E \u0432 \\\\( x_B \\\\) \u0438 \\\\( c_B \\\\).
FirstIteration.fillMainTable=\u0413\u043B\u0430\u0432\u043D\u0430\u0442\u0430 \u0447\u0430\u0441\u0442 \u043E\u0442 \u0442\u0430\u0431\u043B\u0438\u0446\u0430\u0442\u0430 \u043F\u043E\u043F\u044A\u043B\u0432\u0430\u043C\u0435 \u0441\u044A\u0441 \u0441\u044A\u043E\u0442\u0432\u0435\u0442\u043D\u0438\u0442\u0435 \u043A\u043E\u0435\u0444\u0438\u0446\u0438\u0435\u043D\u0442\u0438 \u043E\u0442 \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u044F\u0442\u0430.
FirstIteration.fillCosts=\u0421\u044A\u043E\u0442\u0432\u0435\u0442\u043D\u0430\u0442\u0430 \u0446\u0435\u043D\u0430 (\u0442\u0435\u0433\u043B\u043E) \u043D\u0430 \u0432\u0441\u044F\u043A\u0430 \u043F\u0440\u043E\u043C\u0435\u043D\u043B\u0438\u0432\u0430\\\\( x_j \\\\) e \\\\(\\overline{c_j} \= \\overline{c'_j} + M \u00CDot \\overline{c''_j}\\\\). \u041F\u0440\u0435\u0441\u043C\u044F\u0442\u0430\u043C\u0435 \\\\(\\overline{c'_j} \u0438 \\overline{c''_j}\\\\) \u043A\u0430\u0442\u043E \u0441\u043A\u0430\u043B\u0430\u0440\u043D\u043E\u0442\u043E \u0443\u043C\u043D\u043E\u0436\u0435\u043D\u0438\u0435 \u043D\u0430 \u0432\u0435\u043A\u0442\u043E\u0440-\u0441\u0442\u044A\u043B\u0431\u043E\u0432\u0435\u0442\u0435 \\\\( c_B \\times w_j \\\\) (\u043A\u044A\u0434\u0435\u0442\u043E \\\\(w_j\\\\) \u0435 j-\u0442\u0438\u044F\u0442 \u0441\u0442\u044A\u043B\u0431 \u043E\u0442 \u0433\u043B\u0430\u0432\u043D\u0430\u0442\u0430 \u0447\u0430\u0441\u0442 \u043D\u0430 \u0442\u0430\u0431\u043B\u0438\u0446\u0430\u0442\u0430) \u0438\u0437\u0432\u0430\u0434\u0438\u043C \u043E\u0442 j-\u0442\u0438\u044F \u043A\u043E\u0435\u0444\u0438\u0446\u0438\u0435\u043D\u0442 \u043E\u0442 \u0446\u0435\u043B\u0435\u0432\u0430\u0442\u0430 \u0444\u0443\u043D\u043A\u0446\u0438\u044F (\u0434\u0430 \u0433\u043E \u043E\u0437\u043D\u0430\u0447\u0438\u043C \u0441\u044A\u0441 \\\\(Z[x_j]\\\\)). \u0422.\u0435. \\\\(\\overline{c_j} \= Z[x_j] - c_B \\times w_j\\\\).
FirstIteration.fillRightSide=\u041D\u0430\u0439-\u0434\u0435\u0441\u043D\u0438\u044F \u0441\u0442\u044A\u043B\u0431 \u043E\u0442 \u0442\u0430\u0431\u043B\u0438\u0446\u0430\u0442\u0430 \u043F\u043E\u043F\u044A\u043B\u0432\u0430\u043C\u0435 \u0441\u044A\u0441 \u0441\u044A\u043E\u0442\u0432\u0435\u0442\u043D\u0438\u0442\u0435 \u043A\u043E\u0435\u0444\u0438\u0446\u0438\u0435\u043D\u0442\u0438 \u043E\u0442 \u0434\u044F\u0441\u043D\u0430\u0442\u0430 \u0441\u0442\u0440\u0430\u043D\u0430 \u043D\u0430 \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u044F\u0442\u0430.
FirstIteration.fillValues=\u0421\u0442\u043E\u0439\u043D\u043E\u0441\u0442\u0442\u0430 \u043D\u0430 \\\\(Z_M\\\\) \u0432 \u0442\u0435\u043A\u0443\u0449\u0438\u044F \u0432\u0440\u044A\u0445 \u0435 \\\\( -\\overline{c_0} \\\\). \u041F\u0440\u0435\u0441\u043C\u044F\u0442\u0430\u043C\u0435 \\\\(\\overline{c'_0} \u0438 \\overline{c''_0}\\\\) \u043E\u0442 \u0441\u043A\u0430\u043B\u0430\u0440\u043D\u043E\u0442\u043E \u0443\u043C\u043D\u043E\u0436\u0435\u043D\u0438\u0435 \u043D\u0430 \u0432\u0435\u043A\u0442\u043E\u0440-\u0441\u0442\u044A\u043B\u0431\u043E\u0432\u0435\u0442\u0435 \\\\( c_B \\times \\overline{b} \\\\).
CriteriaCheck.optimalityCriterionFailed=\u041A\u0440\u0438\u0442\u0435\u0440\u0438\u044F\u0442 \u0437\u0430 \u043E\u043F\u0442\u0438\u043C\u0430\u043B\u043D\u043E\u0441\u0442 \u043D\u0435 \u0435 \u0443\u0434\u043E\u0432\u043B\u0435\u0442\u0432\u043E\u0440\u0435\u043D\: \u0418\u043C\u0430 \u043E\u0446\u0435\u043D\u043A\u0430 \\\\( \\overline{c_q} < 0 \\\\) \u0437\u0430 \u043D\u044F\u043A\u043E\u0435 q. \u041F\u0440\u043E\u043C\u0435\u043D\u043B\u0438\u0432\u0430\u0442\u0430, \u0447\u0438\u044F\u0442\u043E \u043E\u0446\u0435\u043D\u043A\u0430 \u0435 \u0442\u043E\u0432\u0430, \u0432\u043B\u0438\u0437\u0430 \u0432 \u0431\u0430\u0437\u0438\u0441\u0430. (\u0410\u043A\u043E \u0438\u043C\u0430 \u043D\u044F\u043A\u043E\u043B\u043A\u043E \u0442\u0430\u043A\u0438\u0432\u0430, \u0442\u043E \u0442\u043E\u0433\u0430\u0432\u0430 \u0432\u0437\u0438\u043C\u0430\u043C\u0435 \u043E\u043D\u0430\u0437\u0438 \u043F\u0440\u043E\u043C\u0435\u043D\u043B\u0438\u0432\u0430 \u0441 \u043D\u0430\u0439-\u043C\u0430\u043B\u044A\u043A \u0438\u043D\u0434\u0435\u043A\u0441.)
CriteriaCheck.optimalityCriterionSuccess=\u041A\u0440\u0438\u0442\u0435\u0440\u0438\u044F\u0442 \u0437\u0430 \u043E\u043F\u0442\u0438\u043C\u0430\u043B\u043D\u043E\u0441\u0442 \u0435 \u0443\u0434\u043E\u0432\u043B\u0435\u0442\u0432\u043E\u0440\u0435\u043D\: \u0417\u0430 \u0432\u0441\u044F\u043A\u0430 \u043E\u0446\u0435\u043D\u043A\u0430 \\\\( \\overline{c_q} \\geq 0 \\\\), \u0437\u0430 \u0432\u0441\u044F\u043A\u043E q. \u0421\u043B\u0435\u0434\u043E\u0432\u0430\u0442\u0435\u043B\u043D\u043E, \u0441\u0435 \u043D\u0430\u043C\u0438\u0440\u0430\u043C\u0435 \u0432 \u043E\u043F\u0442\u0438\u043C\u0430\u043B\u0435\u043D \u0432\u0440\u044A\u0445.
CriteriaCheck.unboundednessCriterionFailed=\u041A\u0440\u0438\u0442\u0435\u0440\u0438\u044F\u0442 \u0437\u0430 \u043D\u0435\u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u043E\u0441\u0442 \u043D\u0435 \u0435 \u0443\u0434\u043E\u0432\u043B\u0435\u0442\u0432\u043E\u0440\u0435\u043D\: \u0438\u043C\u0430 \u043A\u043B\u0435\u0442\u043A\u0430 \u043E\u0442 \u0442\u0430\u0431\u043B\u0438\u0446\u0430\u0442\u0430 \u0432 \u0441\u0442\u044A\u043B\u0431\u0430 \\\\(w_q \\\\), \u043F\u0440\u0438\u043D\u0430\u0434\u043B\u0435\u0436\u0430\u0449 \u043D\u0430 \u0432\u043B\u0438\u0437\u0430\u0449\u0430\u0442\u0430 \u0432 \u0431\u0430\u0437\u0438\u0441\u0430 \u043F\u0440\u043E\u043C\u0435\u043D\u043B\u0438\u0432\u0430, \u0441\u0430 \u043D\u0435\u043F\u043E\u043B\u043E\u0436\u0438\u0442\u0435\u043B\u043D\u0438. \u0412 \u043E\u0431\u0449\u0438\u044F \u0441\u043B\u0443\u0447\u0430\u0439 \u0442\u0435 \u0441\u0430 \u043D\u044F\u043A\u043E\u043B\u043A\u043E \u0438 \u0442\u043E\u0433\u0430\u0432\u0430 \u0432\u0437\u0438\u043C\u0430\u043C\u0435 \u0438\u043D\u0434\u0435\u043A\u0441a p \u043D\u0430 \u043A\u043B\u0435\u0442\u043A\u0430\u0442\u0430 \\\\( w_pq \\\\), \u0442\u0430\u043A\u044A\u0432 \u0447\u0435 \u0447\u0430\u0441\u0442\u043D\u043E\u0442\u043E \\\\( \\overline{b_p} \\over w_pq \\\\) \u0435 \u043C\u0438\u043D\u0438\u043C\u0430\u043B\u043D\u043E. (\u0410\u043A\u043E \u0438\u043C\u0430 \u043D\u044F\u043A\u043E\u043B\u043A\u043E \u0442\u0430\u043A\u0438\u0432\u0430, \u0442\u043E \u0442\u043E\u0433\u0430\u0432\u0430 \u0432\u0437\u0438\u043C\u0430\u043C\u0435 \u043E\u043D\u0430\u0437\u0438 \u043A\u043B\u0435\u0442\u043A\u0430 \u0441 \u043D\u0430\u0439-\u043C\u0430\u043B\u044A\u043A \u0438\u043D\u0434\u0435\u043A\u0441.) \u041F\u0440\u043E\u043C\u0435\u043D\u043B\u0438\u0432\u0430\u0442\u0430, \u0447\u0438\u0439\u0442\u043E \u0438\u043D\u0434\u0435\u043A\u0441 \u0435 \u0442\u043E\u0432\u0430, \u0438\u0437\u043B\u0438\u0437\u0430 \u0438\u0437\u0432\u044A\u043D \u0431\u0430\u0437\u0438\u0441\u0430.
CriteriaCheck.unboundednessCriterionSuccess=\u041A\u0440\u0438\u0442\u0435\u0440\u0438\u044F\u0442 \u0437\u0430 \u043D\u0435\u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u043E\u0441\u0442 \u0435 \u0443\u0434\u043E\u0432\u043B\u0435\u0442\u0432\u043E\u0440\u0435\u043D\: \u0437\u0430 \u043D\u044F\u043A\u043E\u0439 \u0438\u043D\u0434\u0435\u043A\u0441 q \\\\( \\overline{c_q} < 0 \u0438 w_q \\leq 0\\\\). \u0421\u043B\u0435\u0434\u043E\u0432\u0430\u0442\u0435\u043B\u043D\u043E, \u0437\u0430\u0434\u0430\u0447\u0430\u0442\u0430 \u0435 \u043D\u0435\u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0430 (\\\\( MIN Z_\u041C \= - \\infty \\\\)), \u0437\u0430\u0449\u043E\u0442\u043E \u0438\u043C\u0430 \u0440\u044A\u0431, \u043F\u043E \u043A\u043E\u0439\u0442\u043E \u0446\u0435\u043B\u0435\u0432\u0430\u0442\u0430 \u0444\u0443\u043D\u043A\u0446\u0438\u044F \u043D\u0430\u043C\u0430\u043B\u044F\u0432\u0430 \u0431\u0435\u0437\u043A\u0440\u0430\u0439\u043D\u043E.
CriteriaCheck.newIteration=\u041A\u0440\u0438\u0442\u0435\u0440\u0438\u0438\u0442\u0435 \u043D\u0435 \u0441\u0430 \u0438\u0437\u043F\u044A\u043B\u043D\u0435\u043D\u0438 - \u043F\u0440\u043E\u0434\u044A\u043B\u0436\u0430\u0432\u0430\u043C\u0435 \u0441\u044A\u0441 \u0441\u043B\u0435\u0434\u0432\u0430\u0449\u0430\u0442\u0430 \u0438\u0442\u0435\u0440\u0430\u0446\u0438\u044F.
CriteriaCheck.endLoopMessage=\u0418\u0437\u043B\u0438\u0437\u0430\u043C\u0435 \u043E\u0442 \u0446\u0438\u043A\u044A\u043B\u0430.
Iteration.fillBasisInTable=\u0422\u0435\u043A\u0443\u0449\u0438\u044F\u0442 \u0431\u0430\u0437\u0438\u0441 \u0437\u0430\u043F\u0438\u0441\u0432\u0430\u043C\u0435 \u0432 \u0441\u0442\u044A\u043B\u0431 \\\\( x_B \\\\), \u0430 \u0442\u0435\u0445\u043D\u0438\u0442\u0435 \u043A\u043E\u0435\u0444\u0438\u0446\u0438\u0435\u043D\u0442\u0438 \u043E\u0442 \u0446\u0435\u043B\u0435\u0432\u0430\u0442\u0430 \u0444\u0443\u043D\u043A\u0446\u0438\u044F - \u0432 \u0441\u0442\u044A\u043B\u0431 \\\\( c_B \\\\).
Iteration.fillBasisColumns=\u041F\u043E\u043F\u044A\u043B\u0432\u0430\u043C\u0435 \u0441\u0442\u044A\u043B\u0431\u043E\u0432\u0435\u0442\u0435, \u0441\u044A\u043E\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0430\u0449\u0438 \u043D\u0430 \u0431\u0430\u0437\u0438\u0441\u043D\u0438\u0442\u0435 \u043F\u0440\u043E\u043C\u0435\u043D\u043B\u0438\u0432\u0438. \u0417\u0430 \u0432\u0441\u044F\u043A\u0430 \u043F\u0440\u043E\u043C\u0435\u043D\u043B\u0438\u0432\u0430 \\\\( x_i \\\\) \u043E\u0442 \u0431\u0430\u0437\u0438\u0441\u0430 i-\u0442\u0438\u044F \u0440\u0435\u0434 \u043F\u043E\u043F\u044A\u043B\u0432\u0430\u043C\u0435 \u0441 1, \u0430 \u043E\u0441\u0442\u0430\u043D\u0430\u043B\u0438\u0442\u0435 - \u0441 0.
Iteration.fillKeyRow=\u041F\u043E\u043F\u044A\u043B\u0432\u0430\u043C\u0435 \u0440\u0435\u0434\u0430 \u043D\u0430 \u043A\u043B\u044E\u0447\u043E\u0432\u0438\u044F \u0435\u043B\u0435\u043C\u0435\u043D\u0442, \u0437\u0430\u043F\u0438\u0441\u0432\u0430\u0439\u043A\u0438 \u0441\u0442\u043E\u0439\u043D\u043E\u0441\u0442\u0442\u0430 \u043D\u0430 \u0441\u044A\u0449\u0430\u0442\u0430 \u043A\u043B\u0435\u0442\u043A\u0430 \u043E\u0442 \u043F\u0440\u0435\u0434\u0438\u0448\u043D\u0430\u0442\u0430 \u0442\u0430\u0431\u043B\u0438\u0446\u0430, \u043D\u043E \u0440\u0430\u0437\u0434\u0435\u043B\u0435\u043D\u0430 \u043D\u0430 \u043A\u043B\u044E\u0447\u043E\u0432\u0438\u044F \u0435\u043B\u0435\u043C\u0435\u043D\u0442\: \u0430\u043A\u043E \\\\( w_{pq} \\\\) e \u043A\u043B\u044E\u0447\u043E\u0432\u0438\u044F\u0442 \u0435\u043B\u0435\u043C\u0435\u043D\u0442, \\\\( t'_{ij} \\\\) - \u043D\u0435\u043F\u043E\u043F\u044A\u043B\u043D\u0435\u043D\u0430 \u043A\u043B\u0435\u0442\u043A\u0430 \u043E\u0442 \u0442\u0430\u0431\u043B\u0438\u0446\u0430\u0442\u0430, \u0430 \\\\( t_{ij} \\\\) - \u0441\u044A\u043E\u0442\u0432\u0435\u0442\u043D\u0430\u0442\u0430 \u043A\u043B\u0435\u0442\u043A\u0430 \u0432 \u043F\u0440\u0435\u0434\u0438\u0448\u043D\u0430\u0442\u0430 \u0442\u0430\u0431\u043B\u0438\u0446\u0430, \u0442\u043E\u0433\u0430\u0432\u0430\: \\\\( t'_{ij} \= t_{ij} \\over w_{pq} \\\\).
Iteration.fillTable=\u041E\u0441\u0442\u0430\u043D\u0430\u043B\u0438\u0442\u0435 \u043A\u043B\u0435\u0442\u043A\u0438 \u043F\u043E\u043F\u044A\u043B\u0432\u0430\u043C\u0435 \u043F\u043E \u041F\u0440\u0430\u0432\u0438\u043B\u043E\u0442\u043E \u043D\u0430 \u043F\u0440\u0430\u0432\u043E\u044A\u043B\u0433\u044A\u043B\u043D\u0438\u043A\u0430\: \u0430\u043A\u043E \\\\( w_{pq} \\\\) e \u043A\u043B\u044E\u0447\u043E\u0432\u0438\u044F\u0442 \u0435\u043B\u0435\u043C\u0435\u043D\u0442, \\\\( t'_{ij} \\\\) - \u043D\u0435\u043F\u043E\u043F\u044A\u043B\u043D\u0435\u043D\u0430 \u043A\u043B\u0435\u0442\u043A\u0430 \u043E\u0442 \u0442\u0430\u0431\u043B\u0438\u0446\u0430\u0442\u0430, \u0430 \\\\( t_{ij} \\\\) - \u0441\u044A\u043E\u0442\u0432\u0435\u0442\u043D\u0430\u0442\u0430 \u043A\u043B\u0435\u0442\u043A\u0430 \u0432 \u043F\u0440\u0435\u0434\u0438\u0448\u043D\u0430\u0442\u0430 \u0442\u0430\u0431\u043B\u0438\u0446\u0430, \u0442\u043E\u0433\u0430\u0432\u0430\: \\\\( t'_{ij} \= t_{ij} - {t_{iq} \u00CDot t_{pj}} \\over w_{pq} \\\\).
Answer.MAnswer=\u041A\u043E\u0435\u0444\u0438\u0446\u0438\u0435\u043D\u0442\u0438\u0442\u0435 \u043E\u0442 \u043D\u0430\u0439-\u0434\u0435\u0441\u043D\u0438\u044F \u0441\u0442\u044A\u043B\u0431 \u043D\u0430 \u0441\u0438\u043C\u043F\u043B\u0435\u043A\u0441 \u0442\u0430\u0431\u043B\u0438\u0446\u0430\u0442\u0430 \u0441\u0430 \u0441\u044A\u043E\u0442\u0432\u0435\u0442\u043D\u0438\u0442\u0435 \u0441\u0442\u043E\u0439\u043D\u043E\u0441\u0442\u0438 \u043D\u0430 \u043F\u043E\u0441\u043B\u0435\u0434\u043D\u0438\u044F \u0431\u0430\u0437\u0438\u0441. \u041E\u0441\u0442\u0430\u043D\u0430\u043B\u0438\u0442\u0435 \u043F\u0440\u043E\u043C\u0435\u043D\u043B\u0438\u0432\u0438 \u0438\u043C\u0430\u0442 \u0441\u0442\u043E\u0439\u043D\u043E\u0441\u0442 0.
Answer.KAnswer=\u0420\u0435\u0448\u0435\u043D\u0438\u0435\u0442\u043E \u043D\u0430 \u041A-\u0437\u0430\u0434\u0430\u0447\u0430\u0442\u0430 \u0441\u0435 \u043F\u043E\u043B\u0443\u0447\u0430\u0432\u0430 \u043A\u0430\u0442\u043E \u043E\u0442 \u0440\u0435\u0448\u0435\u043D\u0438\u0435\u0442\u043E \u043D\u0430 \u041C-\u0437\u0430\u0434\u0430\u0447\u0430\u0442\u0430 \u0441\u0435 \u043F\u0440\u0435\u043C\u0430\u0445\u043D\u0430\u0442 \u041C-\u043F\u0440\u043E\u043C\u0435\u043D\u043B\u0438\u0432\u0438\u0442\u0435 (\u0434\u043E\u0431\u0430\u0432\u0435\u043D\u0438 \u043F\u0440\u0438 \u0441\u044A\u0437\u0434\u0430\u0432\u0430\u043D\u0435\u0442\u043E \u043D\u0430 \u041C-\u0437\u0430\u0434\u0430\u0447\u0430\u0442\u0430).
Answer.MAnswerMVarsNonZero=\u041A-\u0437\u0430\u0434\u0430\u0447\u0430\u0442\u0430 \u043D\u044F\u043C\u0430 \u0440\u0435\u0448\u0435\u043D\u0438\u0435, \u0437\u0430\u0449\u043E\u0442\u043E \u0441\u044A\u0449\u0435\u0441\u0442\u0432\u0443\u0432\u0430 \u041C-\u043F\u0440\u043E\u043C\u0435\u043D\u043B\u0438\u0432\u0430 (\u0434\u043E\u0431\u0430\u0432\u0435\u043D\u0430 \u043F\u0440\u0438 \u0441\u044A\u0437\u0434\u0430\u0432\u0430\u043D\u0435\u0442\u043E \u043D\u0430 \u041C-\u0437\u0430\u0434\u0430\u0447\u0430\u0442\u0430), \u0447\u0438\u044F\u0442\u043E \u0441\u0442\u043E\u0439\u043D\u043E\u0441\u0442 \u043D\u0435 \u0435 0 \u0432 \u0440\u0435\u0448\u0435\u043D\u0438\u0435\u0442\u043E \u043D\u0430 \u041C-\u0437\u0430\u0434\u0430\u0447\u0430\u0442\u0430.
Answer.LAnswer=\u0420\u0435\u0448\u0435\u043D\u0438\u0435\u0442\u043E \u043D\u0430 \u043E\u0440\u0438\u0433\u0438\u043D\u0430\u043B\u043D\u0430\u0442\u0430 \u0437\u0430\u0434\u0430\u0447\u0430 \u0441\u0435 \u043F\u043E\u043B\u0443\u0447\u0430\u0432\u0430 \u043A\u0430\u0442\u043E \u043E\u0442 \u0440\u0435\u0448\u0435\u043D\u0438\u0435\u0442\u043E \u043D\u0430 \u041A-\u0437\u0430\u0434\u0430\u0447\u0430\u0442\u0430 \u0441\u0435 \u043F\u0440\u0435\u043C\u0430\u0445\u043D\u0430\u0442 \u041A-\u043F\u0440\u043E\u043C\u0435\u043D\u043B\u0438\u0432\u0438\u0442\u0435 (\u0434\u043E\u0431\u0430\u0432\u0435\u043D\u0438 \u043F\u0440\u0438 \u0441\u044A\u0437\u0434\u0430\u0432\u0430\u043D\u0435\u0442\u043E \u043D\u0430 \u041A-\u0437\u0430\u0434\u0430\u0447\u0430\u0442\u0430). \u0421\u044A\u0449\u043E \u0442\u0430\u043A\u0430, \u0432\u0441\u0438\u0447\u043A\u0438 \u043F\u0440\u043E\u043C\u0435\u043D\u043B\u0438\u0432\u0438 \u043E\u0442 \u0432\u0438\u0434\u0430 \\\\( x_i^+, x_i^- \\\\) \u0441\u0435 \u0437\u0430\u043C\u0435\u043D\u044F\u0442 \u0441 \u043E\u0440\u0438\u0433\u0438\u043D\u0430\u043B\u043D\u0430\u0442\u0430 \u043F\u0440\u043E\u043C\u0435\u043D\u043B\u0438\u0432\u0430 \\\\( x_i \= x_i^+ - x_i^- \\\\).
Answer.moreAnswersHint=\u0412\u044A\u0437\u043C\u043E\u0436\u043D\u043E \u0435 \u0434\u0430 \u0438\u043C\u0430 \u0438 \u0434\u0440\u0443\u0433\u0438 \u0440\u0435\u0448\u0435\u043D\u0438\u044F \u043D\u0430 \u0437\u0430\u0434\u0430\u0447\u0430\u0442\u0430. \u0422\u0435 \u043C\u043E\u0433\u0430\u0442 \u0434\u0430 \u0431\u044A\u0434\u0430\u0442 \u043E\u0442\u043A\u0440\u0438\u0442\u0438 \u0441\u043B\u0435\u0434 \u0434\u043E\u043F\u044A\u043B\u043D\u0438\u0442\u0435\u043B\u043D\u043E \u0438\u0437\u0441\u043B\u0435\u0434\u0432\u0430\u043D\u0435 \u043D\u0430 \u0441\u044A\u0441\u0435\u0434\u043D\u0438\u0442\u0435 \u0432\u044A\u0440\u0445\u043E\u0432\u0435 \u0438 \u043F\u043E\u0441\u043E\u043A\u0438.
Answer.KAndLEmpty=\u041A-\u0437\u0430\u0434\u0430\u0447\u0430\u0442\u0430 \u0438 \u043F\u044A\u0440\u0432\u043E\u043D\u0430\u0447\u0430\u043B\u043D\u0430\u0442\u0430 \u0437\u0430\u0434\u0430\u0447\u0430 \u0438\u043C\u0430\u0442 \u043F\u0440\u0430\u0437\u043D\u0438 \u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u0438 \u043C\u043D\u043E\u0436\u0435\u0441\u0442\u0432\u0430.
Answer.KAndLUnbounded=\u041A-\u0437\u0430\u0434\u0430\u0447\u0430\u0442\u0430 \u0438 \u043F\u044A\u0440\u0432\u043E\u043D\u0430\u0447\u0430\u043B\u043D\u0430\u0442\u0430 \u0437\u0430\u0434\u0430\u0447\u0430 \u0441\u0430 \u043D\u0435\u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\: \\\\( MIN Z \= - \\infty \\\\).