allToMinimum=\u0412\u0441\u0438\u0447\u043A\u0438 \u043E\u043F\u0442\u0438\u043C\u0438\u0437\u0430\u0446\u0438\u043E\u043D\u043D\u0438 \u0437\u0430\u0434\u0430\u0447\u0438, \u043A\u043E\u0438\u0442\u043E \u0440\u0435\u0448\u0430\u0432\u0430\u043C\u0435 \u0441\u0430 \u0437\u0430 \u041C\u0418\u041D\u0418\u041C\u0423\u041C \u043D\u0430 \u0446\u0435\u043B\u0435\u0432\u0430\u0442\u0430 \u0444\u0443\u043D\u043A\u0446\u0438\u044F
processNegativeParts=\u0417\u0430 \u0432\u0441\u044F\u043A\u0430 \u043F\u0440\u043E\u043C\u0435\u043D\u043B\u0438\u0432\u0430, \u043A\u043E\u044F\u0442\u043E \u043D\u0435 \u0435 \u0437\u0430\u0434\u044A\u043B\u0436\u0438\u0442\u0435\u043B\u043D\u043E \u043F\u043E\u043B\u043E\u0436\u0438\u0442\u0435\u043B\u043D\u0430, \u044F \u0440\u0430\u0437\u0431\u0438\u0432\u0430\u043C\u0435 \u043D\u0430 \u0434\u0432\u0435 \u0447\u0430\u0441\u0442\u0438-\u0442\u0430\u043A\u0430\u0432\u0430 \u0441 \u043F\u043E\u043B\u043E\u0436\u0438\u0442\u0435\u043B\u0435\u043D \u0437\u043D\u0430\u043A \u0438 \u0442\u0430\u043A\u0430\u0432\u0430 \u0441 \u043E\u0442\u0440\u0438\u0446\u0430\u0442\u0435\u043B\u0435\u043D. \u041E\u0442\u0440\u0430\u0437\u044F\u0432\u0430\u043C\u0435 \u043F\u0440\u043E\u043C\u044F\u043D\u0430\u0442\u0430 \u0432 \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u044F\u0442\u0430.
noNegativesAtRightSide=\u0421\u0443\u043F\u0435\u0440\! \u041D\u044F\u043C\u0430\u043C\u0435 \u043E\u0442\u0440\u0438\u0446\u0430\u0442\u0435\u043B\u043D\u0430 \u0434\u044F\u0441\u043D\u0430 \u0447\u0430\u0441\u0442 \u0432 \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u044F\u0442\u0430.
alreadyMinimum=\u0412 \u0434\u0430\u0434\u0435\u043D\u0430\u0442\u0430 \u0437\u0430\u0434\u0430\u0447\u0430 \u0432\u0435\u0447\u0435 \u0441\u0435 \u0442\u044A\u0440\u0441\u0438 \u043C\u0438\u043D\u0438\u043C\u0443\u043C. \u0421\u043C\u0435\u043B\u043E \u043D\u0430\u043F\u0440\u0435\u0434\!
toMinimumConversionRule=\u041F\u0440\u0435\u043E\u0431\u0440\u0430\u0437\u0443\u0432\u0430\u043C\u0435 \u043A\u044A\u043C \u0437\u0430\u0434\u0430\u0447\u0430 \u0437\u0430 \u043C\u0438\u043D\u0438\u043C\u0443\u043C \u043F\u043E \u043F\u0440\u0430\u0432\u0438\u043B\u043E\u0442\u043E max(Z)\=min(-Z) \u0442.\u0435. \u043E\u0431\u0440\u044A\u0449\u0430\u043C\u0435 \u0437\u043D\u0430\u043A\u0430 \u043D\u0430 \u0432\u0441\u0438\u0447\u043A\u0438 \u043F\u0440\u043E\u043C\u0435\u043D\u043B\u0438\u0432\u0438 \u0432 \u0446\u0435\u043B\u0435\u0432\u0430\u0442\u0430 \u0444\u0443\u043D\u043A\u0446\u0438\u044F
rightSidesToPositiveRule=\u0417\u0430 \u0434\u0430 \u0431\u044A\u0434\u0430\u0442 \u0432\u0441\u0438\u0447\u043A\u0438 \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u044F \u0441 \u043F\u043E\u043B\u043E\u0436\u0438\u0442\u0435\u043B\u043D\u0430 \u0434\u044F\u0441\u043D\u0430 \u0447\u0430\u0441\u0442, \u043E\u0431\u0440\u044A\u0449\u0430\u043C\u0435 \u0437\u043D\u0430\u043A\u0430 \u0438\u043C \u043A\u044A\u0434\u0435\u0442\u043E \u0435 \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E.
toEquationsRule=\u0412\u0441\u044F\u043A\u043E \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0435\u043D\u0438\u0435 \u0432\u044A\u0432 \u0444\u043E\u0440\u043C\u0430\u0442\u0430 \u043D\u0430 \u043D\u0435\u0440\u0430\u0432\u0435\u043D\u0441\u0442\u0432\u043E \u0441\u0435 \u043F\u0440\u0435\u043E\u0431\u0440\u0430\u0437\u0443\u0432\u0430 \u0432 \u0440\u0430\u0432\u0435\u043D\u0441\u0442\u0432\u043E \u0447\u0440\u0435\u0437 \u0434\u043E\u0431\u0430\u0432\u044F\u043D\u0435 \u043D\u0430 \u0434\u043E\u043F\u044A\u043B\u043D\u0438\u0442\u0435\u043B\u043D\u0430 \u043F\u0440\u043E\u043C\u0435\u043D\u043B\u0438\u0432\u0430 \u043A\u044A\u043C \u043B\u044F\u0432\u0430\u0442\u0430 \u0447\u0430\u0441\u0442 \u0430\u043A\u043E \u0437\u043D\u0430\u043A\u044A\u0442 \u0435 <\= \u0438 \u043E\u0442\u0440\u0438\u0446\u0430\u0442\u0435\u043B\u043D\u0430 \u0442\u0430\u043A\u0430\u0432\u0430 \u0432 \u043F\u0440\u043E\u0442\u0438\u0432\u0435\u043D \u0441\u043B\u0443\u0447\u0430\u0439
